---
kind: type
id: T:Autodesk.Revit.DB.EvaluatedParameter
source: html/1e01eb05-aeae-d72b-5b11-0dbfa45e440b.htm
---
# Autodesk.Revit.DB.EvaluatedParameter

Hold the evaluated ParameterValue and Definition of a parameter.

## Syntax (C#)
```csharp
public class EvaluatedParameter : IDisposable
```